import json
import os
import re
import sys
import wcwidth


ITEM_MAPPING = {"100933":"熊胆","110001":"逍遥散","110002":"再造膏","110003":"承气散","110004":"黑玉断续膏","110005":"天香断续胶",
"110006":"九转还魂丹","110007":"双冲饮","110008":"三黄宝腊丹","110009":"青龙散","110010":"茯苓首乌丸","110011":"田七鲨胆散",
"110012":"九花玉露丸","110013":"十全大补丹","110014":"牛黄血竭丹","110015":"通犀地龙丸","110016":"胭脂泪","110017":"千锤百炼丹",
"110018":"飘飘丸","110019":"洗髓再造丹","110020":"神恩通慧丹","110021":"千年人参","110022":"大王蛇胆","110023":"朱蛤","110024":"玉蜂浆",
"110025":"怪鲶鱼","110027":"回阳五龙膏","110028":"三顺散","110031":"腊八粥","110032":"神鱼","110033":"老鼠肉","110034":"玄冰烈火酒",
"110035":"黑蚂蚁升精丸","110036":"西湖醋鱼","110037":"道口烧鸡","110038":"龙井虾仁","110039":"叫化子鸡","110040":"东坡肉","110041":"开水白菜",
"110042":"蜜汁火腿","110043":"人蔘鸡汤","110044":"阎家羊肉汤","110045":"鲤鱼焙面","110046":"小还丹","110047":"麻婆豆腐","110048":"肉包子",
"110049":"五宝花蜜酒","110050":"咸鱼","110051":"小白豆浆","110052":"夫妻肺片","110053":"三丝敲鱼","110054":"洛阳燕菜","110055":"担担面",
"110056":"桂圆红枣鸡汤","110057":"包叶智慧果","130015":"智慧果","130034":"回锅肉","130068":"大红袍","130069":"半山妖",
"130070":"即墨老酒","130071":"汾酒","130072":"西凤酒","130087":"五粮液","130088":"宝丰酒","130089":"杜康酒","130091":"法华经","130092":"般若心经",
"130093":"金刚经","130094":"维摩诘经","130107":"新鲜豆腐","130114":"白菜","130115":"爆米花"}

WEAPON_MAPPING = {'100002':'太乙刀剑','100003':'无极刀剑','100004':'阴阳倒乱刃','100005':'紫金双刃','100101':'粗布拳套','100102':'皮手套','100103':'鹿革手套','100104':'离魂金线缠',
'100105':'玄铁手套','100106':'金丝手套','100107':'萃毒指','100108':'精钢拳套','100109':'天蚕丝手套','100110':'铁手套','100201':'单刀','100202':'银口九齿刀',
'100203':'长虹雁翎刀','100204':'霹雳刀','100205':'鬼头刀','100206':'龙鳞宝刀','100207':'苗族弯刀','100208':'百辟刀','100209':'环柄刀','100210':'太皇刀',
'100211':'血饮','100212':'圆月弯刀','100213':'阎罗','100214':'菊一文字.无铭','100215':'三日月.无铭','100216':'村正','100217':'玄铁刀','100301':'铁剑',
'100302':'冰心','100303':'白晶剑','100304':'盘月剑','100305':'天羽剑','100306':'太极剑','100307':'龙渊剑','100308':'巨阙剑','100309':'湛卢剑','100310':'九真剑',
'100311':'镇岳','100312':'龙脊剑','100313':'太虚剑','100314':'撼天古剑','100315':'玄铁重剑','100316':'辟邪','100317':'殇瑶','100318':'紫薇软剑','100319':'琼华剑',
'100320':'传家宝剑','100321':'含光剑','100322':'白虹剑','100323':'倚天剑','130040':'清风剑','100401':'木棍','100402':'齐眉棍','100403':'烧火棍','100404':'疯魔杖',
'100405':'升龙棍','100406':'定海神针','100407':'玄铁棍','100408':'牛头叉','100501':'飞刀','100502':'暴雨梨花','100503':'金钗','100504':'神剑镖','100505':'雷震天',
'100506':'离火玄冰镖','100507':'金针','100508':'十六串吕','100601':'毒龙鞭','100613':'兽王鞭','100602':'蝎尾鞭','100603':'神农锄','100604':'弦箫剑','100605':'舞天环',
'100606':'乌烟','100607':'孔雀翎','100608':'花开四季','100614':'江亭谈古','100609':'日月双轮','100610':'珠圆玉润','100611':'涯角枪','100612':'鹤嘴','100701':'紫蝶绣鞋',
'100702':'凌波踏霜','100703':'惊鸿靴','100704':'虎步龙行','100961':'银狐飞絮','100954':'七彩云霞','130049':'佛剑','130120':'潇湘夜雨','130121':'云雨雷霆棍'}

EQUIP_MAPPING = {'100801':'粗布背心','100802':'藤甲','100803':'布衣','100804':'皇图','100805':'绫罗衫','100806':'无常衫','100807':'血玲珑','100808':'金铃白绸',
'100809':'铁甲','100810':'金蚕宝衣','100811':'明光甲','100812':'正气甲','100813':'金刚甲','100814':'炼神甲','100815':'五色甲','100816':'黑天','100817':'霹雳宝甲',
'100818':'软猬甲','100960':'虎鲨劲装','130038':'乌蚕背心','100901':'玉鸟纹佩','100902':'夜明珠','100903':'合浦珍珠','100904':'武林宝典','100905':'月牙御守',
'100906':'绿山水画伞','100907':'丐帮布袋','100908':'灌铅骰子','100909':'唤蛇笛','100910':'七色琉璃珠','100911':'兽王戒','100912':'天师护符','100913':'玩具木剑',
'100914':'蛇雕像','100915':'鱼雕像','100916':'龟雕像','100917':'蟹雕像','100918':'蛙雕像','100919':'鹤雕像','100920':'接骨木魔杖','100921':'圣火令','100922':'观音明心鼎',
'100923':'金饭碗','100924':'菊花','100926':'山茶花','100925':'兰花','100928':'火红金丹','100929':'醉芙蓉','100930':'湖笔徽墨','100931':'鬼面蝎','100932':'蛇王',
'100935':'熊皮披风','100936':'亚古兽神盔','100937':'绕梁琴','100938':'投名状','100939':'达摩像','100940':'臭垢丸','100941':'西洋怀表','100942':'酒仙胡芦','100943':'香包',
'100944':'翡翠护符','100945':'黑玉镯','100946':'朱玉金簪','100947':'裂开的玉镯子','110026':'机关武偶','130067':'武林通鉴','130076':'三彩武士俑','130077':'玉鱼龙',
'130096':'映山红','130097':'蟠龙纹盘','130098':'金兽','130099':'鹰形金冠饰','130100':'玉辟邪','130101':'青铜龙首神兽','130102':'纯金明王像','130104':'狗皮膏药',
'130118':'盗墓笔记','130119':'太极图'}

WUGONG_MAPPING = {'120001':'刀山剑岳精要','120002':'阴错阳差感悟','120003':'摩诃无量感悟','120004':'幽冥十三式感悟','120005':'坎离水火剑精要',
'120006':'抖鳞虎扑式感悟','120007':'古月照今尘感悟','120008':'天山六阳掌精要','120009':'天山折梅手精要','120010':'开太极精要','120011':'苍天有极精要',
'120012':'龙战于野精要','120013':'醉拳精要','120014':'螳螂拳精要','120015':'劈卦神拳精要','120016':'无相劫指精要','120017':'多罗叶指精要',
'120018':'大金刚拳法精要','120019':'石破天惊拳精要','120020':'铁掌精要','120021':'野球拳精要','120022':'万佛朝宗精要','120023':'化骨绵掌精要',
'120024':'八卦游身掌感悟','120025':'缠丝八爪感悟','120026':'火焰刀感悟','120027':'八仙指路精要','120028':'一阳指精要','120029':'六脉神剑谱',
'120030':'拜月七诀','120031':'九阴神爪人皮','120032':'鹰爪功','120033':'落英神剑掌','120034':'兰花拂穴手精要','120035':'八卦乱环式精要','120036':'血刀刀法感悟',
'120037':'狂龙逆斩武学精要','120038':'残存亦末路感悟','120039':'庖丁解牛刀精要','120040':'天涯明月刀精要','120041':'推天献印精要','120042':'蚩尤刀法精要',
'120043':'魔刀七杀精要','120044':'快雪时晴刀感悟','120045':'八方藏刀式精要','120046':'燃木刀法精要','120047':'狂风刀法精要','120048':'十殿阎罗刀精要',
'120049':'阴法渡冥河精要','120050':'井中八法精要','120051':'浪花斩铁势感悟','120052':'毒龙刀法精要','120053':'慈悲刀法精要','120054':'金顶剑法',
'120055':'情意七剑精要','120056':'太极化清精要','120057':'鹤翼苍穹精要','120058':'天山幻影剑精要','120059':'不动一剑痕武学精要','120060':'龙泣剑精要',
'120061':'镇五岳精要','120062':'归藏剑精要','120063':'独孤九剑感悟','120064':'无招胜有招','120065':'辟邪剑法精要','120066':'流星飞坠精要',
'120067':'玉女剑法精要','120068':'夺命三仙剑精要','120069':'饮中八仙剑精要','120070':'天外飞仙精要','120071':'无双无对精要','120072':'连城剑法精要',
'120073':'金蛇剑法精要','120074':'天龙八部剑精要','120075':'苗家剑法精要','120076':'八艘飞精要','120077':'万毒入化精要','120078':'软虹蛛索精要',
'120079':'银蛇千转精要','120080':'万蛇狂舞精要','120081':'百兽之境感悟','120082':'重峦复嶂曲','120083':'十面埋伏曲谱','120084':'百鸟朝凤曲感悟',
'120085':'碧海潮声曲谱','120086':'笑傲江湖曲','120087':'荆轲武诀精要','120088':'聂隐剑精要','120089':'化功大法','120090':'催魂蚀心精要',
'120091':'静莲蝶雨精要','120092':'点血截脉精要','120093':'神农济世精要','120094':'占事略诀','120095':'神曲但丁','120096':'烟雾弹制作法',
'120097':'鳄鱼的眼泪','120098':'一个时辰变戏精','120099':'逍遥迷踪腿精要','120100':'佛山无影脚感悟','120101':'虎鹤双形腿精要',
'120102':'如影随形腿精要','120103':'风神腿精要','120104':'地煞绝命腿精要','120105':'龙吞暴','120106':'满天花雨感悟','120107':'小李飞刀谱',
'120108':'奇毒天镖谱','120109':'风魔手里剑','120110':'含沙射影谱','120111':'弹指神通精要','120112':'意乱情迷感悟','120113':'风随白云飞精要',
'120114':'达摩武诀精要','120115':'大闹天宫精要','120116':'灵蛇杖精要','120117':'大须弥山棍精要','120118':'天下无狗感悟','120119':'醉卧乾坤精要',
'120120':'一醉逍遥感悟','120121':'天王枪法精要','120122':'回马枪精要','120123':'罗汉伏魔棍精要','120124':'天魔解体大法','120125':'天魔鞭精要'}

NEIGONG_MAPPING = {'121001':'东方宝典','121002':'铁罗汉','121003':'迅雷剑法','121004':'万物皆数','121005':'小无相功','121006':'大湿婆密咒',
'121007':'先天功','121008':'日月神功','121009':'虎啸功','121010':'血刀经','121011':'金雁功','121012':'明玉功','121013':'九阴总纲','121014':'九阴飞絮篇',
'121015':'灵飞经','121016':'清心普善咒','121017':'沧海一笑','121018':'玉女心经','121019':'天山心法','121020':'紫霞神功','121021':'葵花宝典','121022':'太极神功',
'121023':'金蛇宝典','121024':'金刚不坏体','121025':'兽王功','121026':'鲸息功','121027':'禅宗莲华功','121028':'地煞无极功','121029':'罗汉伏魔功','121030':'一为全全为一',
'121031':'华陀医典','121032':'吸星大法','121033':'修罗心法','121034':'正气诀','121035':'连山诀','121036':'梯云踪','121037':'玄女经','121038':'龙象般若功残本',
'121039':'少林铁布衫','121040':'化功大法残本','121041':'玄冥神功残本','121043':'苗蛊毒功残本','121044':'十王走马势感悟','121045':'声无哀乐论','130020':'狂风剑法',
'130025':'逍遥御风','130030':'九阳神功','130031':'乾坤大挪移','130043':'风花雪月曲谱','130046':'神龙密咒','130047':'化骨绵掌','130059':'倚天屠龙功','130060':'意寒神功',
'130061':'混元功','130062':'药王神篇','130066':'武林群侠传','130123':'乌衣宝典','130124':'裂风鞭法精要'}

NPC_MAPPING = {'100008':'凌香儿','100017':'无瑕子','100019':'老胡','100026':'醉仙','100027':'橘叟','100028':'神医','100029':'仙音','100030':'书生',
'100031':'丹青','100033':'沈澜','100037':'方云华','100054':'任清璇','100056':'纪玟','100058':'蓝婷','100059':'史燕','100061':'风吹雪','100065':'史刚',
'100066':'史义','100072':'西门峰','100075':'江瑜','100078':'关伟','100081':'唐冠南','100082':'唐中慧','100085':'夏侯非','100089':'商仲仁','100091':'杨云',
'100096':'巩光杰','100135':'徐子骐','100297':'陆少临','100299':'燕宇','100419':'花痴','200000':'卫紫绫','200001':'韦子陵','200016':'水盼盼','200017':'龙墨',
'200020':'萧复','200022':'塔娅','200027':'敖广','200038':'不动','200039':'岳胖子','200040':'岳晓遥','200044':'楚绘','210001':'谷月轩','210002':'荆棘','210003':'沈湘芸',
'210004':'古实','210005':'秦红殇','210006':'风吹雪','210007':'傅剑寒','210008':'任剑南','210009':'萧遥','210048':'小阿曼','210055':'游进','210159':'入魔的萧复',
'600035':'令狐大侠','600096':'谷月轩','600097':'谷月轩','600100':'骗子少女','800015':'谷月轩','800016':'荆棘','800035':'沈湘芸','800036':'古实','800057':'秦红殇',
'800075':'江瑜','800091':'杨云','800092':'傅剑寒','800094':'任剑南','800098':'萧遥',
'100015':'谷月轩 特殊状态','100016':'荆棘 特殊状态','100021':'王蓉 特殊状态','100035':'沈湘芸 特殊状态','100036':'古实 特殊状态','100043':'虚真 特殊状态',
'100055':'赵雅儿 特殊状态','100057':'秦红殇 特殊状态','100060':'齐丽 特殊状态','100062':'风吹雪 特殊状态','100092':'傅剑寒 特殊状态','100094':'任剑南 特殊状态',
'100098':'萧遥 特殊状态','100134':'徐子易 特殊状态','199999':'少女 特殊状态','210160':'纺纱女 特殊状态','220001':'谷月轩 特殊状态','600013':'想象的少阁主 特殊状态',
'600069':'荆棘3 特殊状态','600090':'落魄书生 特殊状态','600098':'午津龙 特殊状态','600099':'富坚由昭 特殊状态','800037':'方云华 特殊状态','800054':'任清璇 特殊状态',
'800059':'史燕 特殊状态','800066':'史义 特殊状态','800089':'商仲仁 特殊状态'}

TALENT_LIST = {
"200":"讨价还价 能以较低的价格买入道具", "201":"无奸不商 能以较高的价格卖出道具", "202":"明察秋毫 容易发现场景上的隐藏物品", "203":"潜龙蝶影 敌人警戒的距离降低",
"204":"大收藏家 可以看见商店隐藏的物品", "205":"喜从天降 战斗掉宝的机率增加", "206":"天生神童 平时可以帮助全队获得更多的经验", "207":"见多识广 平时可以帮助全队获得更多的阅历",
"208":"神农百草 容易发现场景上的草药","209":"矿石冶炼 容易发现场景上的矿石",
"210":"毒物探索 容易发现场景上的毒虫",
"301":"兄弟情深 每有一名队友伤重离场时，获得霸体，下次攻击必定暴击",
"302":"血战到底 第一次伤重离场时，以意志力残存，继续再战",
"303":"隐匿 休息后进入隐匿状态，隐匿状态下攻击必定暴击",
"304":"遗策点穴 伤重离场时，周遭二格敌人下回合不能行动",
"305":"妙手空空 攻击时有概率偷得敌人身上物品，目标血量越低，成功概率越大",
"339":"神偷盗帅 攻击时有概率偷得敌人身上物品，目标血量越低，成功概率越大",
"306":"有事先走 血量低于15%必定离场（把史燕这个天赋去除，她就不会乱离除让我们破财了）",
"307":"国色天香 周遭二格男性角色伤害提升",
"308":"我佛慈悲 攻击后不会造成对方伤重离场，必定留下一条生路",
"309":"背刺 从背后攻击，必定暴击",
"310":"逆境 气血越低，攻击越高",
"311":"战意 周遭二格敌人越多，攻击越高",
"312":"玉树临风 周遭二格女性角色伤害提升",
"313":"反击必暴 反击时必定暴击",
"314":"霹雳火 伤重离场时，投掷霹雳雷火弹造成周遭二格敌人损伤气血",
"315":"以眼还眼 被暴击后，下次攻击必定暴击",
"316":"老子有钱 每次攻击时有机率耗损队伍财产，洒出金钱镖提升伤害",
"317":"唯我独尊 我方场上只剩自己时，每次攻击必定暴击",
"318":"以眼还眼 被暴击后，下次攻击必定暴击（有重）",
"319":"天生神童 战斗后获得经验加成",
"320":"妙手着春 战斗中使用丹药成效提升。我方道具使用冷却时间减少，敌方冷却时间大幅增加",
"321":"越战越勇 攻击造成对方伤重离场后，获得聚气与狂暴状态",
"322":"武器大师 使用武器的队友攻击提升",
"323":"搏击大师 拳掌指腿的攻击提升",
"324":"花香四溢 队友内力耗损降低，敌人内力耗损提升",
"325":"绵里藏针 同伴离场时，获得绵里针状态，恢复气血、减伤并且必定反击",
"326":"神机妙算 我方侠客休息时可回复更多气血与内力",
"327":"凌波微步 攻击后可再次移动",
"328":"十香软筋 伤重离场时，施放烟雾让周遭四格敌人内力流失",
"329":"天意难违 伤重离场时，给予攻击者意志消沉三回合",
"330":"意乱情迷 伤重离场时，随机让一名敌人暂时陷入混乱状态",
"331":"吃香喝辣 攻击时有概率食用背包的食物，提升能力",
"332":"王者风范 周遭二格同伴越多，伤害越高",
"333":"趁人之危 攻击造成对方伤重离场后，下一次攻击必定暴击",
"334":"惺惺相惜 同伴伤重离场时，其他队友会登场帮助",
"335":"并肩作战 身旁同伴攻击时，有概率一起攻击",
"336":"锦上添花 我方道具使用冷却时间减少，敌方冷却时间增加",
"338":"嗜酒如命 攻击时有概率饮用背包的酒，提升能力",
"341":"遗策内伤 伤重离场时，造成周遭二格敌人内伤",
"342":"遗策破甲 伤重离场时，造成周遭二格敌人破甲",
"343":"遗策目盲 伤重离场时，造成周遭二格敌人目盲",
"344":"遗策晕眩 伤重离场时，造成周遭二格敌人晕眩",
"345":"遗策恐惧 伤重离场时，造成周遭二格敌人恐惧",
"346":"遗策气盾 伤重离场时，让周遭二格友方获得气盾",
"347":"遗策必暴 伤重离场时，让周遭二格友方获得必定暴击",
"348":"遗策聚气 伤重离场时，让周遭二格友方恢复气血",
"349":"遗策归元 伤重离场时，让周遭二格友方获得归元",
"350":"遗策噬气 伤重离场时，让周遭二格友方获得噬气",
"351":"意志坚定 不受意乱情迷影响",
"352":"支持 身旁同伴攻击时，有概率一起攻击",
"353":"损人利己 每有一名队友伤重离场时，获得气盾，下次攻击必定暴击"}

NPC_ATTR_LIST = [
    [1,"臂力","iStr", 100],
    [2,"臂力上限","iMaxStr", 100],
    [3,"根骨", "iCon", 100],
    [4,"根骨上限","iMaxCon", 100],
    [5,"悟性","iInt", 100],
    [6,"悟性上限","iMaxInt", 100],
    [7,"身法","iDex", 100],
    [8,"身法上限","iMaxDex", 100],
    [9,"闪避","iDodge", 100],
    [10,"反击","iCounter", 100],
    [11,"暴击","iCri", 100],
    [12,"防御暴击","iDefendCri", 100],
    [13,"防御反击","iDefendCounter", 100],
    [14,"移动格数","iMoveStep", 10],
    [15,"破剑","_MartialDef","DefSword",100],
    [16,"破刀","_MartialDef","DefBlade",100],
    [17,"破箭","_MartialDef","DefArrow",100],
    [18,"破掌","_MartialDef","DefFist",100],
    [19,"破气","_MartialDef","DefGas",100],
    [20,"破索","_MartialDef","DefRope",100],
    [21,"破鞭","_MartialDef","DefWhip",100],
    [22,"破枪","_MartialDef","DefPike",100],
    [23,"剑法","_MartialArts","UseSword",100],
    [24,"刀法","_MartialArts","UseBlade",100],
    [25,"箭器","_MartialArts","UseArrow",100],
    [26,"拳掌","_MartialArts","UseFist",100],
    [27,"气功","_MartialArts","UseGas",100],
    [28,"软索","_MartialArts","UseRope",100],
    [29,"钢鞭","_MartialArts","UseWhip",100],
    [30,"枪棍","_MartialArts","UsePike",100],
    [31,"天赋","TalentList"]
]


def main():
    print("欢迎使用侠客风云传前传存档修改器！本修改器由网上热心网友于2020年4月手工制作。如有疑问，请联系作者ivan.wzx@gmail.com。")
    input("请确保游戏已关闭，回车继续")
    root = input("游戏存档目录（steam用户目录在Steam\\userdata\\xxxxxxxxx\\xxxxxx\\remote，普通用户目录在Tale of Wuxia: Prequel\\Config\\SaveData）：")
    if not os.path.exists(root):
        print("路径没找到！")
        return
    
    savefileindex = os.path.join(root, "SaveTitle.SaveTitle")
    with open(savefileindex) as f:
        data_index = json.load(f)
    save_count = 0
    for index in data_index:
        if index["m_bHaveData"]:
            pattern = re.compile("Save(\d+).Save")
            save_file = pattern.search(index["m_strPlaceImageName"])
            save_file_index = int(save_file.group(1)) + 1
            print("存档{} 存档时间：{}".format(save_file_index, index["m_strTrueYear"]))
    
    savefiles = [f for f in os.listdir(root) if f.startswith("Save") and f.endswith(".Save")]
    user_input = input("找到{}个存档，需要修改存档(0:退出)：".format(len(savefiles)))
    if user_input == "0" or user_input == "":
        return
    savefile = os.path.join(root, "Save{}.Save".format(int(user_input)-1))

    data = None
    modified = False
    with open(savefile) as f:
        data = json.load(f)
    
    while(True):
        print("0-退出 1-修改金钱 2-修改阅历点数 3-修改物品 4-修改人物属性")
        print("小Tip：想要人物学习某种武功/内功，可以修改物品加入相应武功秘籍")
        print("小Tip: 想要升级某种武功/内功，可以修改物品增加智慧果的数量")
        user_input=input("我想：")
        if user_input == "0":
            break
        if user_input == "1":
            input_value=input("当前金钱{}，我想修改为：".format(data['m_iMoney']))
            if input_value == "":
                continue
            data['m_iMoney'] = int(input_value)
            modified = True
            print("操作完成")
        
        if user_input == "2":
            input_value=input("当前阅历点数{}，我想修改为：".format(data['m_iAttributePoints']))
            if input_value == "":
                continue
            data['m_iAttributePoints'] = int(input_value)
            modified = True
            print("操作完成")
        
        if user_input == "3":
            print("当前拥有以下物品：")
            items = data["m_BackpackList"]
            item_list = []
            for item in items:
                item_id = str(item["m_ItemID"])
                name = None
                name = ITEM_MAPPING[item_id] if item_id in ITEM_MAPPING else name
                name = WUGONG_MAPPING[item_id] if item_id in WUGONG_MAPPING else name
                name = NEIGONG_MAPPING[item_id] if item_id in NEIGONG_MAPPING else name
                name = EQUIP_MAPPING[item_id] if item_id in EQUIP_MAPPING else name
                name = WEAPON_MAPPING[item_id] if item_id in WEAPON_MAPPING else name
                if name is not None:
                    item_id = item_id + "" + name + ":"
                info = "{}{}".format(manual_wcwidth(item_id, 25), str(item["m_iAmount"]))
                item_list.append(info)
            print(format_list_string(item_list, 30, 3))
            user_selection = input("是否查看物品编号(Y/N):")
            if user_selection.lower() in {"yes", "y"}:
                while(True):
                    user_selection = input("我想查看 （0：返回，1：武器，2：装备，3：武学，4：内功，5：其他物品）：")
                    if user_selection == "":
                        continue
                    if int(user_selection) == 0:
                        break
                    if int(user_selection) == 1:
                        print(format_list_string(["{}:{}".format(key, value) for key, value in WEAPON_MAPPING.items()], 30, 3))
                    if int(user_selection) == 2:
                        print(format_list_string(["{}:{}".format(key, value) for key, value in EQUIP_MAPPING.items()], 30, 3))
                    if int(user_selection) == 3:
                        print(format_list_string(["{}:{}".format(key, value) for key, value in WUGONG_MAPPING.items()], 30, 3))
                    if int(user_selection) == 4:
                        print(format_list_string(["{}:{}".format(key, value) for key, value in NEIGONG_MAPPING.items()], 30, 3))
                    if int(user_selection) == 5:
                        print(format_list_string(["{}:{}".format(key, value) for key, value in ITEM_MAPPING.items()], 30, 3))
            id=input("我想修改/增加物品编号：")
            value=int(input("修改/增加数量为："))
            modified = False
            for item in items:
                item_id = str(item["m_ItemID"])
                if item_id == id:
                    item["m_iAmount"] = value
                    modified = True
            if not modified:
                items.append({"m_bNew":False,"m_iAmount":value,"m_ItemID":int(id)})
            modified = True
            print("操作完成")
        
        if user_input == "4":
            print("当前在队人员为：")
            msg = ""
            i = 0
            for npc_id in data["m_TeammateList"]:
                msg = msg + "({})".format(i)
                i = i + 1
                if str(npc_id) in NPC_MAPPING:
                    msg = msg + NPC_MAPPING[str(npc_id)]
                else:
                    msg = msg + str(npc_id)
                msg = msg + ", "
            print(msg)
            user_selection = input("我想修改：")
            npc_id = data["m_TeammateList"][int(user_selection)]
            for npc in data["m_NpcList"]:
                if npc["iNpcID"] == npc_id:
                    while(True):
                        print("当前属性值：")
                        for att in NPC_ATTR_LIST:
                            if len(att) <= 4:
                                att_val = npc[att[2]] 
                            if len(att) == 5:
                                att_val = npc[att[2]][att[3]]
                            print(str(att[0]) + att[1] + ":" + str(att_val))
                        user_selection=input("我想修改属性(0:返回):")
                        if user_selection == "" or int(user_selection) == 0:
                            break
                        user_selection = int(user_selection) - 1
                        att = NPC_ATTR_LIST[user_selection]
                        if user_selection == 30:
                            print("现有天赋：")
                            print("\n".join("{}:{}".format(str(talent), TALENT_LIST[str(talent)]) for talent in npc["TalentList"]))
                            user_selection2 = input("是否查看天赋代码（Y/N）：")
                            if user_selection2.lower() in {"y","yes"}:
                                print("\n".join("{}:{}".format(k,v) for k,v in TALENT_LIST.items()))
                            value = input("我想改为(多个天赋用逗号隔开)：")
                            value  = [int(v.strip()) for v in value.split(",") if v.strip() != ""]
                        else:
                            value=int(input("修改{}（建议最大值{}），我想改为：".format(att[1], att[-1])))
                        if len(att) <= 4:
                            npc[att[2]] = value 
                        if len(att) == 5:
                            npc[att[2]][att[3]] = value
                        modified = True
                        print("操作完成")
    
    if modified:
        user_input = input("是否保存修改结果(Y/N)：")
        if user_input.lower() in {"yes", "y"}:
            with open(savefile, 'w') as outfile:
                json.dump(data, outfile)
            print("存档已修改！")


def manual_wcwidth(s, width):
    size = 0
    for c in s:
        size = size + wcwidth.wcswidth(c)
    return s + " " * (width - size)


def format_list_string(strings, width, tab_num):
    msg = ""
    counter = 0
    for s in strings:
        msg = msg + manual_wcwidth(s, width)
        counter = counter + 1
        if counter == tab_num:
            msg = msg + "\n"
            counter = 0
    return msg


if __name__ == "__main__":
    try:
        main()
    except:
        print("程序已崩溃 T~~T")
    input("程序结束，按任意键退出")